vvivivivv/SC2079-MDP-Group-24/STM32/MDP/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED3_Pin GPIO_PIN_10
#define LED3_GPIO_Port GPIOE
#define OLED_DC_Pin_Pin GPIO_PIN_11
#define OLED_DC_Pin_GPIO_Port GPIOD
#define OLED_RES_Pin_Pin GPIO_PIN_12
#define OLED_RES_Pin_GPIO_Port GPIOD
#define OLED_SDA_Pin_Pin GPIO_PIN_13
#define OLED_SDA_Pin_GPIO_Port GPIOD
#define OLED_SCL_Pin_Pin GPIO_PIN_14
#define OLED_SCL_Pin_GPIO_Port GPIOD
#define Left_IR_Pin GPIO_PIN_6
#define Left_IR_GPIO_Port GPIOC
#define Right_IR_Pin GPIO_PIN_9
#define Right_IR_GPIO_Port GPIOC
#define Buzz_Pin_Pin GPIO_PIN_8
#define Buzz_Pin_GPIO_Port GPIOA
/* USER CODE BEGIN Private defines */

#define LED3_Pin GPIO_PIN_10
#define LED3_GPIO_Port GPIOE

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
